src/Catalogs/ТипыЗадачКонтрольПодключений/ТипыЗадачКонтрольПодключений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыЗадачКонтрольПодключений</name>
  <predefined>
    <items>
      <name>КонтрольПодключенийНевозможноПодключиться</name>
      <description>Восстановить возможность подключения к информационной базе</description>
    </items>
    <items>
      <name>ЛожнаяТревога</name>
      <description>Выяснить причину ложной тревоги</description>
    </items>
    <items>
      <name>КонтрольПодключенийТаймаут</name>
      <description>Не удалось подключиться за указанное время</description>
    </items>
  </predefined>
  <attributes>
    <name>ОповещатьПриКаждомИнциденте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПериодОповещенияСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПриВыполнении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПредупреждения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйТекстПредупреждения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПервойРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПовторнойРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ТипыЗадачКонтрольПодключений/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПолучитьОсновнойШаблон(Команда)
	Объект.ДополнительныйТекстПредупреждения = ПолучитьОсновнойШаблонНаСервере(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьШаблонПервойРегистрации(Команда)
	Объект.ШаблонПервойРегистрации = ПолучитьШаблонПервойРегистрацииНаСервере(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьШаблонПовторнойРегистрации(Команда)
	Объект.ШаблонПовторнойРегистрации = ПолучитьШаблонПовторнойРегистрацииНаСервере(Объект.Ссылка);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОсновнойШаблонНаСервере(Ссылка)
	Если Ссылка = Справочники.ТипыЗадачКонтрольПодключений.КонтрольПодключенийНевозможноПодключиться Тогда
		Возврат Справочники.ТипыЗадачКонтрольПодключений.ПолучитьОсновнойШаблонКонтрольПодключенийНевозможноПодключиться();
	ИначеЕсли Ссылка = Справочники.ТипыЗадачКонтрольПодключений.КонтрольПодключенийТаймаут Тогда
		Возврат Справочники.ТипыЗадачКонтрольПодключений.ПолучитьОсновнойШаблонКонтрольПодключенийТаймаут();	
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьШаблонПервойРегистрацииНаСервере(Ссылка)
	Если Ссылка = Справочники.ТипыЗадачКонтрольПодключений.КонтрольПодключенийНевозможноПодключиться Тогда
		Возврат Справочники.ТипыЗадачКонтрольПодключений.ПолучитьШаблонПервойРегистрацииКонтрольПодключенийНевозможноПодключиться();
	ИначеЕсли Ссылка = Справочники.ТипыЗадачКонтрольПодключений.КонтрольПодключенийТаймаут Тогда
		Возврат Справочники.ТипыЗадачКонтрольПодключений.ПолучитьШаблонПервойРегистрацииКонтрольПодключенийТаймаут();
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьШаблонПовторнойРегистрацииНаСервере(Ссылка)
	Если Ссылка = Справочники.ТипыЗадачКонтрольПодключений.КонтрольПодключенийНевозможноПодключиться Тогда
		Возврат Справочники.ТипыЗадачКонтрольПодключений.ПолучитьШаблонПовторнойРегистрацииКонтрольПодключенийНевозможноПодключиться();
	ИначеЕсли Ссылка = Справочники.ТипыЗадачКонтрольПодключений.КонтрольПодключенийТаймаут Тогда
		Возврат Справочники.ТипыЗадачКонтрольПодключений.ПолучитьШаблонПовторнойРегистрацииКонтрольПодключенийТаймаут();
	КонецЕсли;
КонецФункции
